export interface Vendor {
  name: string;
  address: string;
  contact: string;
  phone: string;
  products: string[];
}

export const vendorsList: Vendor[] = [
  {
    name: "環揚環保工程股份有限公司",
    address: "台南市中西區武聖路239巷10弄13號",
    contact: "林秉豐",
    phone: "(06)358-8833 / 0919-842917",
    products: ["廢水系統", "其他"]
  },
  {
    name: "台灣綠能工程顧問有限公司",
    address: "高雄市前鎮區一心一路243號10樓之2號",
    contact: "顏才華",
    phone: "07-3316378 / 0912150321",
    products: ["併網申請"]
  },
  {
    name: "畜旺工程行",
    address: "雲林縣崙背鄉五魁村五常路34-16號",
    contact: "郭川暉、侯文賢",
    phone: "0921-351051、0955-278522",
    products: ["脫硫設備", "儲氣設備"]
  },
  {
    name: "桓達科技股份有限公司",
    address: "新北市土城區土城工業區自強街16號",
    contact: "吳奎雍",
    phone: "02-22696789 / 0935-164-262",
    products: ["脫硫設備", "儲氣設備", "沼氣發電機", "發電機維修", "沼氣發電系統商"]
  },
  {
    name: "龍鐵機械工業股份有限公司",
    address: "桃園市蘆竹區南山路二段470巷23號",
    contact: "羅文廷",
    phone: "03-324-2370 / 0932-365776",
    products: ["脫硫設備", "其他", "沼氣發電系統商"]
  },
  {
    name: "晶昌環境機械有限公司",
    address: "台南市善化區小新營400號",
    contact: "林淑惠",
    phone: "06-5850446 #217 / 0915-235820",
    products: ["廢水系統", "沼氣發電機", "沼氣發電系統商"]
  },
  {
    name: "阿布科技有限公司",
    address: "台南市歸仁區民生南街二段317號",
    contact: "李偉立",
    phone: "06-2797101 / 0936163112",
    products: ["儲氣設備"]
  },
  {
    name: "振偉開發股份有限公司",
    address: "台南市善化區中山路349號5樓",
    contact: "翁振博",
    phone: "06-5818611",
    products: ["併網申請"]
  },
  {
    name: "高豊機械有限公司",
    address: "高雄市楠梓區芍蕉路1號",
    contact: "黃振育",
    phone: "07-3581570 / 0956-636195",
    products: ["廢水系統", "儲氣設備"]
  },
  {
    name: "飛瑞工程行",
    address: "雲林縣虎尾鎮新吉里林森路二段436巷68號1樓",
    contact: "陳增吉",
    phone: "0927-331906",
    products: ["沼氣發電機", "發電機維修"]
  },
  {
    name: "三敏電機股份有限公司",
    address: "新北市深坑區北深路三段153號7樓",
    contact: "鄭密鈴",
    phone: "02-26629292 / 0926-611617",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "沼氣發電系統商"]
  },
  {
    name: "元錩工業股份有限公司",
    address: "台中市棲梧區向上路九段382巷106號",
    contact: "蔡昆達",
    phone: "04-26305899 / 0966-552856",
    products: ["廢水系統", "其他", "沼氣發電系統商"]
  },
  {
    name: "所羅門股份有限公司",
    address: "台北市內湖區行忠路42號",
    contact: "張啓鴻、王士銘",
    phone: "02-8791-8989 #2169 / 0905-366360",
    products: ["沼氣發電機", "沼氣發電系統商"]
  },
  {
    name: "台灣理研計器股份有限公司",
    address: "台南市善化區陽明路87號",
    contact: "邱先生",
    phone: "06-5811224",
    products: ["其他"]
  },
  {
    name: "大勵金屬科技股份有限公司",
    address: "台北市士林區中山北路五段687號6樓之1",
    contact: "周順軍",
    phone: "02-28367188 / 0937-027018",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "併網申請", "發電機維修", "其他", "沼氣發電系統商"]
  },
  {
    name: "萬年清環境工程股份有限公司",
    address: "台中市西屯區龍富路五段261號",
    contact: "李俊穎",
    phone: "04-22550168 / 0961-230-575",
    products: ["廢水系統"]
  },
  {
    name: "怡和企業",
    address: "高雄市苓雅區武信街15巷11號1樓",
    contact: "王文俊",
    phone: "0932741836",
    products: ["沼氣發電機", "發電機維修"]
  },
  {
    name: "牧陽能控股份有限公司",
    address: "台南市歸仁區歸仁十三路一段6號2樓A201室",
    contact: "曾先生",
    phone: "06-5121698",
    products: ["併網申請", "沼氣發電系統商"]
  },
  {
    name: "安葆國際實業股份有限公司",
    address: "新北市新店區北新路3段207之5號5樓",
    contact: "李昱慶",
    phone: "02-29108118 #828 / 0975-700371",
    products: ["沼氣發電機", "併網申請", "發電機維修", "其他", "沼氣發電系統商"]
  },
  {
    name: "君宬環保顧問有限公司",
    address: "彰化縣員林市三愛里合作街123號1樓",
    contact: "徐小姐",
    phone: "04-8315932",
    products: ["廢水系統"]
  },
  {
    name: "祺晴國際有限公司",
    address: "臺北市大同區南京西路315號",
    contact: "郝宗祺",
    phone: "02-89213637 / 0987-633898",
    products: ["併網申請"]
  },
  {
    name: "超立科技有限公司",
    address: "南投縣南投市南營路95號",
    contact: "黃經理、徐經理",
    phone: "04-23354488 #216 / 0933-360504",
    products: ["沼氣發電機", "發電機維修", "沼氣發電系統商"]
  },
  {
    name: "奇堅實業有限公司",
    address: "屏東縣長治鄉繁昌村中山路150號",
    contact: "楊偉立",
    phone: "08-7627999 / 0937-336534",
    products: ["廢水系統"]
  },
  {
    name: "破壁環技股份有限公司",
    address: "高雄市大寮區民權街81號",
    contact: "林長青",
    phone: "07-7317555 / 0926-167356",
    products: ["廢水系統", "脫硫設備", "儲氣設備"]
  },
  {
    name: "富立業工程顧問股份有限公司",
    address: "臺中市西屯區福中二街16巷17號",
    contact: "蔡國拱",
    phone: "04-23585953 #152 / 0916-301085",
    products: ["廢水系統"]
  },
  {
    name: "晉緯工程股份有限公司",
    address: "高雄市左營區正心街116號11樓之2",
    contact: "周昆崙",
    phone: "07-5562011",
    products: ["廢水系統"]
  },
  {
    name: "日成科技股份有限公司",
    address: "臺北市中山區民生東路2段157號3樓",
    contact: "李長穎 博士",
    phone: "02-25024072 / 0921-787422",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "併網申請", "其他", "沼氣發電系統商"]
  },
  {
    name: "漢米科技股份有限公司",
    address: "臺北市信義區吳興街600巷100弄55號5樓",
    contact: "孫國昌",
    phone: "0935-150938",
    products: ["沼氣發電機", "沼氣發電系統商"]
  },
  {
    name: "中華生質能源有限公司",
    address: "嘉義縣水上鄉水上村民治街2號1樓",
    contact: "王文興",
    phone: "0987-587979",
    products: ["沼氣發電機"]
  },
  {
    name: "螢助有限公司",
    address: "南投縣草屯鎮碧興路一段348號",
    contact: "鄧燕堂",
    phone: "04-24622299",
    products: ["儲氣設備"]
  },
  {
    name: "澄豐環境科技有限公司",
    address: "桃園市楊梅區富民街33巷240號",
    contact: "呂政宏",
    phone: "03-2821298 / 0936-130792",
    products: ["脫硫設備"]
  },
  {
    name: "謙品綠色動力有限公司",
    address: "台中市北區崇德路一段631號19樓之一",
    contact: "廖本右",
    phone: "04-22380298 / 0912-955858",
    products: ["脫硫設備", "儲氣設備", "沼氣發電機", "併網申請", "發電機維修", "其他", "沼氣發電系統商"]
  },
  {
    name: "勇強電機工業股份有限公司",
    address: "台中市后里區聯合里三重二路200巷22號",
    contact: "詹勝貴",
    phone: "04-25562783",
    products: ["沼氣發電機", "發電機維修"]
  },
  {
    name: "擎億股份有限公司",
    address: "高雄市前鎮區千富街199號",
    contact: "孫志成",
    phone: "07-8215888 / 0956-670150",
    products: ["發電機維修"]
  },
  {
    name: "廣昱科技股份有限公司",
    address: "新北市中和區中山路二段296號12樓",
    contact: "賴正興",
    phone: "02-22457090",
    products: ["沼氣發電機"]
  },
  {
    name: "電聯運通股份有限公司",
    address: "新竹市延平路三段470巷19 弄二號2樓之2",
    contact: "曾令遠",
    phone: "03-5162723",
    products: ["其他"]
  },
  {
    name: "博非特綠能科技公司",
    address: "苗栗縣銅鑼鄉新興路685號",
    contact: "廖永亮",
    phone: "0920-519996",
    products: ["沼氣發電機"]
  },
  {
    name: "潔康企業有限公司",
    address: "彰化縣秀水鄉彰水路一段439號",
    contact: "曹起熊",
    phone: "04-7681117 #5 / 0935-398728",
    products: ["沼氣發電系統商"]
  },
  {
    name: "錡源科技股份有限公司",
    address: "桃園市龜山區鐘義路三段215巷16-1號",
    contact: "黃永政",
    phone: "03-3960236 / 0986-003535",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機"]
  },
  {
    name: "承泓環保科技有限公司",
    address: "屏東縣內埔鄉富田村里和路110號",
    contact: "鍾振楠",
    phone: "08-7789127 / 0929-809133",
    products: ["廢水系統"]
  },
  {
    name: "業興環境科技股份有限公司",
    address: "台北市南京東路5段168號12樓",
    contact: "翁榮華",
    phone: "02-27691002 #131 / 0933-921119",
    products: ["沼氣發電系統商"]
  },
  {
    name: "世健企業股份有限公司",
    address: "高雄市岡山區介壽路10巷25弄18號",
    contact: "孫乘風",
    phone: "07-625-1258 / 0931-988926",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "發電機維修"]
  },
  {
    name: "台灣傳鑫能源有限公司",
    address: "嘉義市西區埤竹路139-1號",
    contact: "李坤信",
    phone: "05-2386161 / 0955-936636",
    products: ["沼氣發電系統商"]
  },
  {
    name: "亞洲氫能股份有限公司",
    address: "新竹科學工業園區 新竹市東區園區二路60號一樓(環球鑫能源)",
    contact: "董舒麟",
    phone: "03-577-1609 / 0935-374695",
    products: ["沼氣發電系統商"]
  },
  {
    name: "宇陽能源科技股份有限公司",
    address: "台北市松山區民生東路3段107巷6號4樓(台北市瑠公農田水利會大樓)",
    contact: "方耀華",
    phone: "02-7751-5151",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "併網申請", "發電機維修", "其他"]
  },
  {
    name: "中華機械股份有限公司",
    address: "高雄市大寮區中庄里鳳屏路一路268號",
    contact: "何亞倫",
    phone: "03-28587333 #311 / 0937-283309",
    products: ["廢水系統", "脫硫設備", "儲氣設備", "沼氣發電機", "併網申請", "發電機維修", "沼氣發電系統商"]
  },
  {
    name: "漢翔航空工業股份有限公司",
    address: "台中市西屯區漢翔路1號之7",
    contact: "陳盈戎",
    phone: "04-2702-0001 #3291 / 0933-553466",
    products: ["沼氣發電機", "發電機維修"]
  },
  {
    name: "祥瑞能源科技股份有限公司",
    address: "新北市五股區中興路一段176巷3號",
    contact: "曾昱森",
    phone: "0982-584250",
    products: ["廢水系統", "脫硫設備", "儲氣設備"]
  }
];
